docs/core_ontology.md
```mermaid
classDiagram 
   class Activity~core~{
       endDateTime dateTime
       id string
       name string
       startDateTime dateTime
   } 
   class Actor~core~{
       id string
       name string
   } 
   class Address~core~{
       street string
       houseNumber string
       postalCode string
       city string
       country string
   } 
   class ConceptualObject~core~{
       id string
       name string
   } 
   class PhysicalObject~core~{
       id string
       name string
   } 
   class Place~core~{
       id string
       name string
   } 
   Place --> Address : hasAddress
   ConceptualObject <--> PhysicalObject : describesPhysicalObject/\ndescribedByConceptualObject
   Activity <--> Actor : hasParticipant/\nparticipatesIn
   Activity <--> ConceptualObject : refersToConceptualObject/\ninvolvedIn
   Activity <--> PhysicalObject : refersToPhysicalObject/\ninvolvedIn
   Actor --> Place : relatedToPlace
   Activity <--> Place : takesPlaceAt/\nhosts
   Address --|> ConceptualObject

```  
